namespace RealEstate.Data.Seeding
{
    public class DistrictsSeeder : ISeeder
    {
        public DistrictsSeeder()
        {

        }

        public Task SeedAsync(ApplicationDbContext dbContext, IServiceProvider serviceProvider)
        {
            var dist = new Dictionary<string, List<string>>();
            dist.Add("Благоевград", new List<string>() { "Грамада", "Изгрев", "Освобождение", "Вароша", "Струмско" });
            dist.Add("Бургас", new List<string>() {"Зорница","Център","Рудник",
"Черно Море",
"Долно Езерово",
"Изгрев",
"Акациите",
"Славейков",
"Сарафово",
"Братя Миладинови",
"Меден Рудник",
"Ветрен",
"Победа",
"Крайморие",
"Възраждане",
"Горно Езерово",
"Лозово",
"Банево",
"Лазур" });
            dist.Add("Варна", new List<string>() { "Максуда",
"Аспарухово",
"Галата",
"Трошево",
"Владислав Варненчик",
"Център",
"Младост",
"Възраждане",
"Ракитника",});
            dist.Add("Велико Търново", new List<string>() { "Асенов",
"Квартала",
"Чолаковци",
"Света Гора",
"Акация",
"Варуша",
"Бузлуджа",});
            dist.Add("Видин", new List<string>() { "Калето", "Нов път" });
            dist.Add("Враца", new List<string>() { "Бистрец", "Медковец" });
            dist.Add("Габрово", new List<string>() { "Варчоци", "Радецки", "Етър" });
            dist.Add("Добрич", new List<string>() {"Иглика",
"Строител",
"Дружба 1",
"Дружба 2",
"Дружба 3",
"Дружба 4"});
            dist.Add("Кърджали", new List<string>() { "Простор",
"Байкал",
"Боровец",
"Прилепци",
"Гледка",
"Център"});
            dist.Add("Кюстендил", new List<string>() { "Въртешево",
"Изток",
"Герена",
"Запад",
"Осогово"});
            dist.Add("Ловеч", new List<string>() { "Младост",
"Здравец",
"Промишлена зона",
"Център"});
            dist.Add("Монтана", new List<string>() {"Жеравица",
"Център",
"Плиска",
"Кошарник",
"Изгрев" });
            dist.Add("Пазарджик", new List<string>() { "Изток",
"Устрем",
"Младост",
"Запад",
"Център",
"Ставропол"});
            dist.Add("Перник", new List<string>() { "Варош",
"Рено",
"Център",
"Монте Карло",
"Клепало",
"Васил Левски"});
            dist.Add("Плевен", new List<string>() { "Воден",
"ВМИ",
"Дружба 1",
"Дружба 2",
"Център"});
            dist.Add("Пловдив", new List<string>() {"Гагарин",
"Гаганица",
"Каменица 1",
"Парк Лалута",
"Каменица 2",
"Бунарджика",
"Кършияка",
"Беломорски",
"Кючук Париж", });
            dist.Add("Разград", new List<string>() {"Възраждане",
"Житница",
"Добровски",
"Център",
"Орел",
"Варош" });
            dist.Add("Русе", new List<string>() {"Веждата",
"Дружба 1",
"Гарата",
"Дружба 3",
"Дружба 2",
"ДЗС" });
            dist.Add("Силистра", new List<string>() { "Център" });
            dist.Add("Сливен", new List<string>() {"Център",
"Надежда",
"Младост",
"Дружба",
"Сини Камъни" });
            dist.Add("Смолян", new List<string>() {"Райково",
"Стар център",
"Невястата",
"Нов център" });
            dist.Add("София", new List<string>() { "Бусманци",
"Люлин 7",
"Младост 1",
"НДК",
"Данабад",
"Люлин 6",
"Люлин 8",
"Левски В",
"Люлин 9",
"Красна поляна 1",
"Левски",
"Люлин 10",
"Бели брези",
"Бояна",
"Витоша",
"Люлин 3",
"Люлин 2",
"Бистрица",
"Герман",
"Левски Г",
"Люлин 5",
"Дружба 2",
"Враждебна",
"Младост 3",
"Център",
"Люлин 4",
"Горна Баня",
"Младост 2",
"Дружба 1",
"Красна поляна 2",
"Красна поляна 3",
"Люлин 1",
"Гео Милев"});
            dist.Add("Стара Загора", new List<string>() { "Самара",
"Дъбрава",
"Лозенец",
"Градински",
"Голеш",
"Самара 2",
"Аязмото",
"Самара 3"});
            dist.Add("Търговище", new List<string>() {"Запад",
"Център",
"Изток",
"Боровец" });
            dist.Add("Хасково", new List<string>() {"Център",
"Република",
"Възраждане",
"Бадема",
"Хисаря",
"Овчарски",
"Болярово" });
            dist.Add("Шумен", new List<string>() {"Пети полк",
"Пожарна",
"Басейна",
"Болницата",
"Еверест",
"Център",
"Херсон",
"Тракия"});
            dist.Add("Ямбол", new List<string>() { "Златен рог",
"Център",
"Крали Марко",
"Диана",
"Изток",
"Зорница"});
        }
    }
}
